Documents/Renault_АктСдачиПриемкиБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_АктСдачиПриемкиБСО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Renault_ПринятыеВОтчетностьБСО</xr:Item>
				<xr:Item>AccumulationRegister.Renault_БСОПоПериодам</xr:Item>
				<xr:Item>AccumulationRegister.Renault_ПринятыеОплатыБезКвитанции</xr:Item>
				<xr:Item>AccumulationRegister.Renault_БСОВОрганизации</xr:Item>
				<xr:Item>AccumulationRegister.Renault_БСОБудущиеПериоды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетностьПринята</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыОперацийАктСдачиПриемкиБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПоВидуСтрахования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтрахования</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСтатусу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БСО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Страхователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ВидыФинансовыхУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипБСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияБСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБСО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияКвитанции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКвитанции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтрахования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплатыПоКвитанции</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховаяПремияОтКлиента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВознаграждениеАгентаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВознаграждениеАгентаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПремияСтраховщику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСтрахования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Агент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключитьВОтчетность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойПолис</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиЗасчетКВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусБСО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_СтатусыБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПолиса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвитанции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезКвитанции</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаСтраховогоПолиса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_ОплатаСтраховогоПолиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Renault_ПринятыеОплатыБезКвитанции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ПринятыеОплатыБезКвитанции</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтраховаяПремияОтКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыОперацийАктСдачиПриемкиБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОплатаСтраховогоПолиса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_ОплатаСтраховогоПолиса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_БСОВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_БСОВОрганизации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Renault_ПринятыеВОтчетностьБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ПринятыеВОтчетностьБСО</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтраховаяПремияОтКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ВидыОперацийАктСдачиПриемкиБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятИзСК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНаТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чистый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ВидыОперацийАктСдачиПриемкиБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ВидыОперацийАктСдачиПриемкиБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктСдачиПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бордеро</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДВОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВстречноеБордеро</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_АктСдачиПриемкиБСО/Ext/ObjectModule.bsl
Перем  БСОДоФильтра Экспорт;
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Если  Модифицированность() Тогда 
		Сообщить("Документ необходимо записать!");
		Возврат;
	КонецЕсли;
	
	Если ИмяМакета = "АктСдачиПриемкиБСО" Тогда
		ПечатьАктаСдачиПриемки(ИмяМакета);
	ИначеЕсли ИмяМакета = "МакетОформленныеБСО" ИЛИ ИмяМакета = "МакетОформленныеБСОИнгосстрах" ИЛИ ИмяМакета = "МакетОформленныеБСОРесо" Тогда
		ПечатьБСО(ИмяМакета, Перечисления.Renault_СтатусыБСО.Продан);
	ИначеЕсли ИмяМакета = "МакетИспорченныеБСО" Тогда
		ПечатьБСО(ИмяМакета, Перечисления.Renault_СтатусыБСО.Испорчен);	
	ИначеЕсли ИмяМакета = "МакетЧистыеБСО" Тогда
		ПечатьБСО(ИмяМакета, Перечисления.Renault_СтатусыБСО.Чистый);	
		
	ИначеЕсли ИмяМакета = "АктСдачиПриемкиБСОРесо" Тогда
		ПечатьАктаСдачиПриемкиРесо("АктСдачиПриемкиБСОРесо");
		//ПечатьБСО(ИмяМакета, Перечисления.Renault_СтатусыБСО.Продан);
	
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ОтчетностьПринята Тогда 
		Отказ = Истина;
		Сообщить("Документ может быт проведен только после принятия отчетности!");
	Иначе 
		//#Если Клиент Тогда
		//	Ответ = Вопрос("После проведения документ будет недоступен для редактирования.Продолжить?",РежимДиалогаВопрос.ДаНет,60);
		//	
		//	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		//		Отказ = Истина;
		//	КонецЕсли;
		//#КонецЕсли //так как, массово проводить невозможно
		
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЧ_БСО", БСО.Выгрузить());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ_БСО.Страхователь,
	               |	ТЧ_БСО.ВидСтрахования,
	               |	ТЧ_БСО.Банк,
	               |	ТЧ_БСО.ТипБСО,
	               |	ТЧ_БСО.СерияБСО,
	               |	ТЧ_БСО.НомерБСО,
	               |	ТЧ_БСО.СерияКвитанции,
	               |	ТЧ_БСО.НомерКвитанции,
	               |	ТЧ_БСО.ДатаСтрахования,
	               |	ТЧ_БСО.ДатаОплатыПоКвитанции,
	               |	ТЧ_БСО.СтраховаяПремияОтКлиента,
	               |	ТЧ_БСО.ВознаграждениеАгентаПроцент,
	               |	ТЧ_БСО.ВознаграждениеАгентаСумма,
	               |	ТЧ_БСО.ПремияСтраховщику,
	               |	ТЧ_БСО.СрокСтрахования,
	               |	ТЧ_БСО.Агент,
				   //|	ТЧ_БСО.Каско,
				   //|	ТЧ_БСО.Даго,
				   //|	ТЧ_БСО.НС,
	               |	ТЧ_БСО.ВключитьВОтчетность,
	               |	ТЧ_БСО.СтраховойПолис,
	               |	ТЧ_БСО.ПроцентСкидкиЗасчетКВ,
	               |	ТЧ_БСО.ОбщаяСумма,
	               |	ТЧ_БСО.СтатусБСО,
	               |	ТЧ_БСО.НомерПолиса,
	               |	ТЧ_БСО.ТипКвитанции,
	               |	ТЧ_БСО.БезКвитанции,
	               |	ТЧ_БСО.ОплатаСтраховогоПолиса
	               |ПОМЕСТИТЬ ВТ_БСО
	               |ИЗ
	               |	&ТЧ_БСО КАК ТЧ_БСО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БСО.ТипБСО,
	               |	ВТ_БСО.СерияБСО,
	               |	ВТ_БСО.НомерБСО,
	               |	ВТ_БСО.ВключитьВОтчетность,
	               |	ВТ_БСО.СтраховаяПремияОтКлиента,
	               |	ВТ_БСО.БезКвитанции,
	               |	ВТ_БСО.ОплатаСтраховогоПолиса
	               |ПОМЕСТИТЬ ВТ_БСОДляОбработки
	               |ИЗ
	               |	ВТ_БСО КАК ВТ_БСО
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_БСО.ТипКвитанции,
	               |	ВТ_БСО.СерияКвитанции,
	               |	ВТ_БСО.НомерКвитанции,
	               |	ВТ_БСО.ВключитьВОтчетность,
	               |	ВТ_БСО.СтраховаяПремияОтКлиента,
	               |	ВТ_БСО.БезКвитанции,
	               |	ВТ_БСО.ОплатаСтраховогоПолиса
	               |ИЗ
	               |	ВТ_БСО КАК ВТ_БСО
	               |ГДЕ
	               |	ВТ_БСО.ТипКвитанции <> ЗНАЧЕНИЕ(Справочник.Renault_ТипыБСО.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БСОДляОбработки.ТипБСО,
	               |	ВТ_БСОДляОбработки.СерияБСО,
	               |	ВТ_БСОДляОбработки.НомерБСО,
	               |	ВТ_БСОДляОбработки.СтраховаяПремияОтКлиента,
	               |	ВТ_БСОДляОбработки.БезКвитанции,
	               |	ВТ_БСОДляОбработки.ОплатаСтраховогоПолиса
	               |ПОМЕСТИТЬ Вт_БСО_ВОтчетность
	               |ИЗ
	               |	ВТ_БСОДляОбработки КАК ВТ_БСОДляОбработки
	               |ГДЕ
	               |	ВТ_БСОДляОбработки.ВключитьВОтчетность
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БСОДляОбработки.ТипБСО,
	               |	ВТ_БСОДляОбработки.СерияБСО,
	               |	ВТ_БСОДляОбработки.НомерБСО,
	               |	ВТ_БСОДляОбработки.СтраховаяПремияОтКлиента,
	               |	ВТ_БСОДляОбработки.БезКвитанции,
	               |	ВТ_БСОДляОбработки.ОплатаСтраховогоПолиса
	               |ПОМЕСТИТЬ Вт_БСО_НеВОтчетность
	               |ИЗ
	               |	ВТ_БСОДляОбработки КАК ВТ_БСОДляОбработки
	               |ГДЕ
	               |	НЕ ВТ_БСОДляОбработки.ВключитьВОтчетность";
				   
	Запрос.Выполнить();
	
	////тест(
	//Запрос.Текст = "выбрать * ИЗ Вт_БСО_ВОтчетность КАК Вт_БСО_ВОтчетность";
	//Вт_БСО_ВОтчетность = Запрос.Выполнить().Выгрузить();
	//
	//Запрос.Текст = "выбрать * ИЗ ВТ_БСОДляОбработки КАК ВТ_БСОДляОбработки";
	//ВТ_БСОДляОбработки = Запрос.Выполнить().Выгрузить();
	////)тест
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.ОплатаСтраховогоПолиса,
	               |	1 КАК Количество,
	               |	ВложенныйЗапрос.ОплатаСтраховогоПолисаСуммаДокумента КАК СтраховаяПремияОтКлиента
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Вт_БСО_ВОтчетность.ОплатаСтраховогоПолиса КАК ОплатаСтраховогоПолиса,
	               |		Вт_БСО_ВОтчетность.ОплатаСтраховогоПолиса.СуммаДокумента КАК ОплатаСтраховогоПолисаСуммаДокумента
	               |	ИЗ
	               |		Вт_БСО_ВОтчетность КАК Вт_БСО_ВОтчетность
	               |	ГДЕ
	               |		Вт_БСО_ВОтчетность.БезКвитанции) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ПринятыеОплатыБезКвитанции.Обороты(, , , ВидОперации = &ВидОперации) КАК Renault_ПринятыеОплатыБезКвитанцииОбороты
	               |		ПО ВложенныйЗапрос.ОплатаСтраховогоПолиса = Renault_ПринятыеОплатыБезКвитанцииОбороты.ОплатаСтраховогоПолиса";
				   
	ДвиженияБезКвитанции = Запрос.Выполнить().Выгрузить();			   

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_БСО_ВОтчетность.ТипБСО,
	               |	ВТ_БСО_ВОтчетность.СерияБСО,
	               |	ВТ_БСО_ВОтчетность.НомерБСО,
	               |	ЕСТЬNULL(Renault_БСОВОрганизацииОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК Количество
	               |ИЗ
	               |	ВТ_БСО_ВОтчетность КАК ВТ_БСО_ВОтчетность
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_БСОВОрганизации.Остатки(
	               |				,
	               |				СтраховаяКомпания = &СтраховаяКомпания
	               |					И Организация = &Организация) КАК Renault_БСОВОрганизацииОстатки
	               |		ПО ВТ_БСО_ВОтчетность.ТипБСО = Renault_БСОВОрганизацииОстатки.ТипБСО
	               |			И ВТ_БСО_ВОтчетность.СерияБСО = Renault_БСОВОрганизацииОстатки.СерияБСО
	               |			И ВТ_БСО_ВОтчетность.НомерБСО = Renault_БСОВОрганизацииОстатки.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Renault_БСОВОрганизации.ТипБСО КАК ТипБСО,
	               |			Renault_БСОВОрганизации.СерияБСО КАК СерияБСО,
	               |			Renault_БСОВОрганизации.НомерБСО КАК НомерБСО,
	               |			Renault_БСОВОрганизации.Количество КАК Количество
	               |		ИЗ
	               |			РегистрНакопления.Renault_БСОВОрганизации КАК Renault_БСОВОрганизации
	               |		ГДЕ
	               |			Renault_БСОВОрганизации.Регистратор = &Ссылка) КАК ВложенныйЗапрос
	               |		ПО ВТ_БСО_ВОтчетность.ТипБСО = ВложенныйЗапрос.ТипБСО
	               |			И ВТ_БСО_ВОтчетность.СерияБСО = ВложенныйЗапрос.СерияБСО
	               |			И ВТ_БСО_ВОтчетность.НомерБСО = ВложенныйЗапрос.НомерБСО
	               |ГДЕ
	               |	ЕСТЬNULL(Renault_БСОВОрганизацииОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_БСО_ВОтчетность.ТипБСО,
	               |	ВТ_БСО_ВОтчетность.СерияБСО,
	               |	ВТ_БСО_ВОтчетность.НомерБСО,
	               |	ЕСТЬNULL(Renault_БСОВОрганизацииОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ";
	ДвиженияБСОВОрганизации = Запрос.Выполнить().Выгрузить();
	
	////тест(
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	Renault_БСОВОрганизации.Период,
	//			   |	Renault_БСОВОрганизации.Регистратор,
	//			   |	Renault_БСОВОрганизации.НомерСтроки,
	//			   |	Renault_БСОВОрганизации.Активность,
	//			   |	Renault_БСОВОрганизации.ВидДвижения,
	//			   |	Renault_БСОВОрганизации.Организация,
	//			   |	Renault_БСОВОрганизации.СтраховаяКомпания,
	//			   |	Renault_БСОВОрганизации.ТипБСО,
	//			   |	Renault_БСОВОрганизации.СерияБСО,
	//			   |	Renault_БСОВОрганизации.НомерБСО,
	//			   |	Renault_БСОВОрганизации.Количество,
	//			   |	Renault_БСОВОрганизации.МоментВремени
	//			   |ИЗ
	//			   |	РегистрНакопления.Renault_БСОВОрганизации КАК Renault_БСОВОрганизации
	//			   |ГДЕ
	//			   |	Renault_БСОВОрганизации.Регистратор = &Ссылка";
	//тз = Запрос.Выполнить().Выгрузить();			   
	////(тест
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_БСО_ВОтчетность.ТипБСО,
	               |	ВТ_БСО_ВОтчетность.СерияБСО,
	               |	ВТ_БСО_ВОтчетность.НомерБСО,
	               |	СУММА(ВТ_БСО_ВОтчетность.СтраховаяПремияОтКлиента) КАК СтраховаяПремияОтКлиента
	               |ИЗ
	               |	ВТ_БСО_ВОтчетность КАК ВТ_БСО_ВОтчетность
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ПринятыеВОтчетностьБСО.Обороты(
	               |				,
	               |				,
	               |				,
	               |				Организация = &Организация
	               |					И СтраховаяКомпания = &СтраховаяКомпания
	               |					И ВидОперации = &ВидОперации) КАК Renault_ПринятыеВОтчетностьБСООбороты
	               |		ПО ВТ_БСО_ВОтчетность.ТипБСО = Renault_ПринятыеВОтчетностьБСООбороты.ТипБСО
	               |			И ВТ_БСО_ВОтчетность.СерияБСО = Renault_ПринятыеВОтчетностьБСООбороты.СерияБСО
	               |			И ВТ_БСО_ВОтчетность.НомерБСО = Renault_ПринятыеВОтчетностьБСООбороты.НомерБСО
				   //|ГДЕ
				   //|	Renault_ПринятыеВОтчетностьБСООбороты.НомерБСО ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_БСО_ВОтчетность.ТипБСО,
	               |	ВТ_БСО_ВОтчетность.СерияБСО,
	               |	ВТ_БСО_ВОтчетность.НомерБСО
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ";
				   
	ДвиженияВключитьВОтчетность = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_БСО_ВОтчетность.ТипБСО,
	               |	ВТ_БСО_ВОтчетность.СерияБСО,
	               |	ВТ_БСО_ВОтчетность.НомерБСО,
	               |	ЕСТЬNULL(Renault_БСОБудущиеПериодыОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК Количество,
	               |	ВТ_БСО_ВОтчетность.СтраховаяПремияОтКлиента КАК СтраховаяПремияОтКлиента
	               |ИЗ
	               |	ВТ_БСО_ВОтчетность КАК ВТ_БСО_ВОтчетность
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_БСОБудущиеПериоды.Остатки(
	               |				,
	               |				Организация = &Организация
	               |					И СтраховаяКомпания = &СтраховаяКомпания
	               |					И ВидОперации = &ВидОперации) КАК Renault_БСОБудущиеПериодыОстатки
	               |		ПО ВТ_БСО_ВОтчетность.ТипБСО = Renault_БСОБудущиеПериодыОстатки.ТипБСО
	               |			И ВТ_БСО_ВОтчетность.СерияБСО = Renault_БСОБудущиеПериодыОстатки.СерияБСО
	               |			И ВТ_БСО_ВОтчетность.НомерБСО = Renault_БСОБудущиеПериодыОстатки.НомерБСО
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Renault_БСОБудущиеПериоды.ТипБСО КАК ТипБСО,
	               |			Renault_БСОБудущиеПериоды.СерияБСО КАК СерияБСО,
	               |			Renault_БСОБудущиеПериоды.НомерБСО КАК НомерБСО,
	               |			Renault_БСОБудущиеПериоды.Количество КАК Количество
	               |		ИЗ
	               |			РегистрНакопления.Renault_БСОБудущиеПериоды КАК Renault_БСОБудущиеПериоды
	               |		ГДЕ
	               |			Renault_БСОБудущиеПериоды.ВидОперации = &ВидОперации
	               |			И Renault_БСОБудущиеПериоды.Регистратор = &Ссылка) КАК ВложенныйЗапрос
	               |		ПО ВТ_БСО_ВОтчетность.ТипБСО = ВложенныйЗапрос.ТипБСО
	               |			И ВТ_БСО_ВОтчетность.СерияБСО = ВложенныйЗапрос.СерияБСО
	               |			И ВТ_БСО_ВОтчетность.НомерБСО = ВложенныйЗапрос.НомерБСО
	               |ГДЕ
	               |	ЕСТЬNULL(Renault_БСОБудущиеПериодыОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) > 0
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ";
	ДвиженияБСОБудущиеПериодыСписать = Запрос.Выполнить().Выгрузить();
	
	Движения.Renault_БСОПоПериодам.Очистить();
	Движения.Renault_ПринятыеВОтчетностьБСО.Очистить();
	Движения.Renault_БСОВОрганизации.Очистить();
	Движения.Renault_БСОБудущиеПериоды.Очистить();
	Движения.Renault_ПринятыеОплатыБезКвитанции.Очистить();
	
	Если НЕ ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ Тогда
	
		Для Каждого Строка Из ДвиженияБСОВОрганизации Цикл
			
			Движение = Движения.Renault_БСОВОрганизации.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Организация = Организация;
			Движение.Период = Дата;
			Движение.СтраховаяКомпания = СтраховаяКомпания;
			Движение.ТипБСО    = Строка.ТипБСО;
			Движение.СерияБСО = Строка.СерияБСО;
			Движение.НомерБСО = Строка.НомерБСО;
			Движение.Количество = Строка.Количество;
		
		КонецЦикла;
		
	КонецЕсли;	
	
	Для Каждого Строка Из ДвиженияВключитьВОтчетность Цикл
		
		Движение = Движения.Renault_ПринятыеВОтчетностьБСО.Добавить();
		Движение.Организация = Организация;
		Движение.Период = Дата;
		Движение.СтраховаяКомпания = СтраховаяКомпания;
		Движение.СтраховаяПремияОтКлиента = Строка.СтраховаяПремияОтКлиента;
		Движение.ТипБСО = Строка.ТипБСО;
		Движение.СерияБСО = Строка.СерияБСО;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.ВидОперации = ВидОперации;
		Движение.Количество = 1;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДвиженияБСОБудущиеПериодыСписать Цикл
		
		Движение = Движения.Renault_БСОБудущиеПериоды.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Организация = Организация;
		Движение.Период = Дата;
		Движение.СтраховаяКомпания = СтраховаяКомпания;
		Движение.СтраховаяПремияОтКлиента = Строка.СтраховаяПремияОтКлиента;
		Движение.ТипБСО = Строка.ТипБСО;
		Движение.СерияБСО = Строка.СерияБСО;
		Движение.НомерБСО = Строка.НомерБСО;
		Движение.ВидОперации = ВидОперации;
		Движение.Количество = Строка.Количество;
		
	КонецЦикла;
	
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ Вт_БСО_НеВОтчетность КАК Вт_БСО_НеВОтчетность";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.Renault_БСОБудущиеПериоды.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		Движение.Период = Дата;
		Движение.СтраховаяКомпания = СтраховаяКомпания;
		Движение.СтраховаяПремияОтКлиента = Выборка.СтраховаяПремияОтКлиента;
		Движение.ТипБСО = Выборка.ТипБСО;
		Движение.СерияБСО = Выборка.СерияБСО;
		Движение.НомерБСО = Выборка.НомерБСО;
		Движение.ВидОперации = ВидОперации;
		Движение.Количество = 1;
		
	КонецЦикла;	
	
	Для Каждого Строка Из ДвиженияБезКвитанции Цикл
		
		Движение = Движения.Renault_ПринятыеОплатыБезКвитанции.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.Период = Дата;
		Движение.ВидОперации = ВидОперации;
		
	КонецЦикла;	
	
КонецПроцедуры

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;

	СтруктураМакетов.Вставить("АктСдачиПриемкиБСО", "Бордеро");
	СтруктураМакетов.Вставить("МакетОформленныеБСО", "Оформленные БСО");
	СтруктураМакетов.Вставить("МакетЧистыеБСО", "Чистые БСО");
	СтруктураМакетов.Вставить("МакетИспорченныеБСО", "Испорченные БСО");
	СтруктураМакетов.Вставить("МакетОформленныеБСОИнгосстрах", "Оформленные Ингосстрах");

	СтруктураМакетов.Вставить("АктСдачиПриемкиБСОРесо", "Бордеро Ресо");
	СтруктураМакетов.Вставить("МакетОформленныеБСОРесо", "Оформленные Ресо");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПечатьБСО(ИмяМакета, мСтатусБСО)
	
	МассивСтрок = БСО.НайтиСтроки(Новый Структура("СтатусБСО", мСтатусБСО));
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	
	Если мСтатусБСО = Перечисления.Renault_СтатусыБСО.Продан Тогда
		ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
	Иначе
		ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	КонецЕСли;	
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = "АКТ № " + Номер;
	Если Найти(Организация.Наименование, "СПб") Тогда
		Область.Параметры.Город = "г. Санкт-Петербург";
	Иначе
		Область.Параметры.Город = "г. Москва";
	КонецЕсли;
	Область.Параметры.Организация = Организация;
	Область.Параметры.Ответственный = Ответственный;
	Область.Параметры.СтраховаяКомпания = СтраховаяКомпания;
	Область.Параметры.Дата = Дата;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	
	НомерСтроки = 1;
	Итого = 0;
	ИтогоКоличество= 0;
	Для Каждого Строка Из МассивСтрок Цикл
		
		Область = Макет.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Строка);
		Область.Параметры.НомерСтроки = НомерСтроки;
		Если мСтатусБСО = Перечисления.Renault_СтатусыБСО.Продан Тогда
			Область.Параметры.СерияНомерКвитанции = "" + Строка.СерияКвитанции + " " + Строка.НомерКвитанции;
		Иначе
			Область.Параметры.Количество = 1;
		КонецЕсли;	
		
		Если мСтатусБСО = Перечисления.Renault_СтатусыБСО.Продан Тогда
			Итого = Итого + Строка.СтраховаяПремияОтКлиента;
		Иначе	
			ИтогоКоличество = ИтогоКоличество + 1; 
		КонецЕсли;	
		
		НомерСтроки = НомерСтроки + 1;
		
		ТабДок.Вывести(Область);
		
	КонецЦикла;	
	
	Область = Макет.ПолучитьОбласть("Итого");
	Если мСтатусБСО = Перечисления.Renault_СтатусыБСО.Продан Тогда
		Область.Параметры.СтраховаяПремияОтКлиентаИтого = Итого;
	Иначе
		Область.Параметры.ИтогоКоличество = ИтогоКоличество;
	КонецЕсли;	
		
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(Область);
	
	ТабДок.Показать();	
	
КонецПроцедуры	

Процедура ПечатьАктаСдачиПриемки(ИмяМакета)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	
	ТабДок.ПолеСверху              = 0;
	ТабДок.ПолеСлева               = 5;
	ТабДок.ПолеСнизу               = 0;
	ТабДок.ПолеСправа              = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб             = Истина;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
		
    Область = Макет.ПолучитьОбласть("Шапка");
	Если Найти(Организация.Наименование, "СПб") Тогда
		Область.Параметры.Город = "г. Санкт-Петербург";
	Иначе
		Область.Параметры.Город = "г. Москва";
	КонецЕсли;	
	Область.Параметры.Заголовок = "АКТ СДАЧИ-ПРИЕМКИ ВЫПОЛНЕННЫХ РАБОТ № " + Номер + " от  " + Формат(Дата,"ДЛФ=ДД");
	Область.Параметры.Текст = "Мы, нижеподписавшиеся, " + """" + СтраховаяКомпания +""""+" в лице ____________, и " + """"+ Организация + """" +" в лице __________, составили настоящий Акт в том, что в период с " + Формат (ПериодС,"ДЛФ=ДД")+ " по " +Формат(ПериодПо,"ДЛФ=ДД") +" Агентом, согласно договору  были оказаны посреднические услуги, связанные с заключением договоров страхования, в результате чего на расчетный счет " + """" + СтраховаяКомпания +"""" + " были перечислены страховые взносы по указанным ниже договорам (полисам)";
	
	ТабДок.Вывести(Область);
	
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	//ТабДок.Вывести(ОбластьШапкаТаблицы);
	
    ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
    ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	Ном              = 0;
	КоличествоСтрок = БСО.Количество();
	НомерСтраницы   = 1;
	НомерСтроки = 1;
	
	// инициализация итогов по странице
	ИтогоСтраховаяПремияОтКлиента = 0;
	ИтогоОбщаяСумма = 0;
	ИтогоВознаграждениеАгентаСумма        = 0;
	ИтогоПремияСтраховщику  = 0;
	//ИтогоКаско       = 0;
	//ИтогоДаго         = 0;
	//ИтогоНС   = 0;
	
	//// инициализация итогов по документу
	//ИтогоМассаБрутто = 0;
	//ИтогоМест        = 0;
	//ИтогоКоличество  = 0;
	//ИтогоСуммаСНДС   = 0;
	//ИтогоСумма       = 0;
	//ИтогоНДС         = 0;
	//Ном              = 0;
		
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
	
	//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	
	Для Каждого Строка Из БСО Цикл
		Если Не Строка.ВключитьВОтчетность Тогда 
			Продолжить;
		КонецЕсли;
		
			Ном           = Ном + 1;
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки =  НомерСтроки + 1;
			ТабДок.Вывести(ОбластьСтрока);
			//Если Ном = 1 Тогда // первая срока
				
				//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
				//ТабДок.Вывести(ОбластьШапкаТаблицы);
				
			//Иначе
			//	
			//	МассивВыводимыхОбластей.Очистить();
			//	МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
			//	МассивВыводимыхОбластей.Добавить(ОбластьИтоги);
			//	Если Ном = КоличествоСтрок Тогда
			//		МассивВыводимыхОбластей.Добавить(ОбластьИтоги);
			//		МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			//	КонецЕсли;		
			//	
			//	Если Ном <> 1 И НЕ ТабДок.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					//ОбластьИтоги.Параметры.ИтогоСтраховаяПремияОтКлиента = ИтогоСтраховаяПремияОтКлиента;
					//ОбластьИтоги.Параметры.ИтогоОбщаяСумма               = ИтогоОбщаяСумма;
					//ОбластьИтоги.Параметры.ИтогоВознаграждениеАгентаСумма        = ИтогоВознаграждениеАгентаСумма;
					//ОбластьИтоги.Параметры.ИтогоПремияСтраховщику  = ИтогоПремияСтраховщику;
					//ОбластьИтоги.Параметры.ИтогоКаско       = ИтогоКаско;
					//ОбластьИтоги.Параметры.ИтогоДаго         = ИтогоДаго;
					//ОбластьИтоги.Параметры.ИтогоНС   = ИтогоНС;
					//
					//ТабДок.Вывести(ОбластьИтоги);
					
					// очистим итоги по странице
					//ИтогоСтраховаяПремияОтКлиента = 0;
					//ИтогоОбщаяСумма = 0;
					//ИтогоВознаграждениеАгентаСумма        = 0;
					//ИтогоПремияСтраховщику  = 0;
					//ИтогоКаско       = 0;
					//ИтогоДаго         = 0;
					//ИтогоНС   = 0;
					
					//НомерСтраницы = НомерСтраницы + 1;
					//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					//ТабДок.Вывести(ОбластьШапкаТаблицы);
					
				//КонецЕсли;
				
			//КонецЕсли;		
			
			//ТабДок.Вывести(ОбластьСтрока);
			
					ИтогоСтраховаяПремияОтКлиента  = ИтогоСтраховаяПремияОтКлиента + Строка.СтраховаяПремияОтКлиента;
					ИтогоОбщаяСумма                = ИтогоОбщаяСумма + Строка.ОбщаяСумма;
					ИтогоВознаграждениеАгентаСумма = ИтогоВознаграждениеАгентаСумма + Строка.ВознаграждениеАгентаСумма;
					ИтогоПремияСтраховщику  = ИтогоПремияСтраховщику + Строка.ПремияСтраховщику;
					//ИтогоКаско       = ИтогоКаско + Строка.Каско;
					//ИтогоДаго        = ИтогоДаго + Строка.Даго;
					//ИтогоНС          = ИтогоНС+ Строка.НС;

				КонецЦикла;
				
				
				
	ИтогоСтраховаяПремияОтКлиента = БСО.Итог("СтраховаяПремияОтКлиента");
	ИтогоОбщаяСумма = БСО.Итог("ОбщаяСумма");
	ИтогоВознаграждениеАгентаСумма = БСО.Итог("ВознаграждениеАгентаСумма");
	ИтогоПремияСтраховщику = БСО.Итог("ПремияСтраховщику");
	//ИтогоКаско = БСО.Итог("Каско");
	//ИтогоДаго =  БСО.Итог("Даго");
	//ИтогоНС = БСО.Итог("НС");
	
	
	ОбластьИтоги.Параметры.ИтогоСтраховаяПремияОтКлиента = ИтогоСтраховаяПремияОтКлиента;
	ОбластьИтоги.Параметры.ИтогоОбщаяСумма = ИтогоОбщаяСумма;
	ОбластьИтоги.Параметры.ИтогоВознаграждениеАгентаСумма = ИтогоВознаграждениеАгентаСумма;
	ОбластьИтоги.Параметры.ИтогоПремияСтраховщику = ИтогоПремияСтраховщику;
	//ОбластьИтоги.Параметры.ИтогоКаско = ИтогоКаско;
	//ОбластьИтоги.Параметры.ИтогоДаго = ИтогоДаго;
	//ОбластьИтоги.Параметры.ИтогоНС = ИтогоНС;
	ТабДок.Вывести(ОбластьИтоги);
	
	//ОбластьПодвала.Параметры.ИтогоСтраховаяПремияОтКлиента = ИтогоСтраховаяПремияОтКлиента;
	ОбластьПодвала.Параметры.ИтогоВознаграждениеАгентаСумма = ИтогоВознаграждениеАгентаСумма;
	ОбластьПодвала.Параметры.ИтогоПремияСтраховщику = ИтогоПремияСтраховщику;
//	ОбластьПодвала.Параметры.Агенту = ИтогоКаско + ИтогоДаго + ИтогоНС;
	
	
	//ОбластьПодвала.Параметры.ИтогоВознаграждениеАгентаСуммаПрописью = "("+ЧислоПрописью(ИтогоСтраховаяПремияОтКлиента, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	ОбластьПодвала.Параметры.ИтогоВознаграждениеАгентаСуммаПрописью = "("+ЧислоПрописью(ИтогоВознаграждениеАгентаСумма, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	ОбластьПодвала.Параметры.ИтогоПремияСтраховщикуПрописью = "("+ЧислоПрописью(ИтогоПремияСтраховщику, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
//	ОбластьПодвала.Параметры.АгентуПрописью = "("+ЧислоПрописью(ИтогоКаско + ИтогоДаго + ИтогоНС, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	ТабДок.Вывести(ОбластьПодвала);
	
	
	
    Область = Макет.ПолучитьОбласть("Подписи");
	Область.Параметры.ОтИмениОрганизации = "От имени " + """" + СтраховаяКомпания + """";
	Область.Параметры.ОтИмениСтраховойКомпании = "От имени "  + """" + Организация + """";
	
	ТабДок.Вывести(Область);
	ТабДок.Показать();
	
КонецПроцедуры	

//Процедура ЗаполнитьТЧ(ВариантЗаполнения) Экспорт
Процедура ЗаполнитьТЧ() Экспорт
	
	Если Проведен Тогда
		Сообщить("Для перезаполнения необходимо отменить проведение документа");
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(БСО) Тогда
		#Если Клиент Тогда
			Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,60);
			Если Ответ = КодВозвратаДиалога.Да Тогда 
				БСО.Очистить();
			Иначе 
				Возврат;
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтраховаяКомпания) Тогда 
		Сообщить("Заполните реквизит ""Страховая компания""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация)Тогда
		Сообщить("Заполните реквизит ""Организация""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодС) Тогда 
		Сообщить("Заполните реквизит ""Период с""!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодПо) Тогда 
		Сообщить("Заполните реквизит ""Период по""!");
		Возврат;
	КонецЕсли;
	
	Запрос=Новый Запрос(ПолучитьМакет("ЗапросЗаполнения").ПолучитьТекст());
	Запрос.УстановитьПараметр("НачалоПериода", ПериодС);
	Запрос.УстановитьПараметр("КонецПериода", ПериодПо);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	
//	Если ВариантЗаполнения = "ЗаполнитьПоПериоду" Тогда ...

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ФормироватьПоВидуСтрахования Тогда
		СписокВидовСтрахования = ВидСтрахования.Получить();
	КонецЕсли;	
			
	Пока Выборка.Следующий()Цикл
		
		//Если ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.Бордеро Тогда 
		//	Если  Не Выборка.СтатусБСО = Перечисления.Renault_СтатусыБСО.Продан Тогда  
		//		Продолжить;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если ФормироватьПоВидуСтрахования И СписокВидовСтрахования.НайтиПоЗначению(Выборка.ВидСтрахования) = неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПоСтатусу И НЕ Статус = Выборка.СтатусБСО Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ И Выборка.КВДВОУ = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Если (ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.Бордеро
			ИЛИ ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ВстречноеБордеро 
			ИЛИ ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ) 
			И Выборка.СтатусБСО <> Перечисления.Renault_СтатусыБСО.Продан Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Выборка.НомерБСО = NULL Тогда
			Продолжить;
		КонецЕсли;	
		
		
		СтрокаБСО = БСО.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаБСО,Выборка);
		//Если СтрокаБСО.СтраховойПолис.НеСвязанСНомеромБСО Тогда
		//	СтрокаБСО.НомерПолиса = СтрокаБСО.СтраховойПолис.НомерПолиса;
		//КонецЕсли;	
		//СтрокаБСО.СрокСтрахования = ?(ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.Бордеро и Не Операция = "ЗаполнитьПоПериоду",Выборка.СрокСтрахования, "С " + Выборка.ДатаНачалаСтрахования + " по " + Выборка.ДатаОкончанияСтрахования); 
		СтрокаБСО.ВключитьВОтчетность = Истина;
		Если ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.Бордеро ИЛИ ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ВстречноеБордеро Тогда
			СтрокаБСО.ВознаграждениеАгентаПроцент = Выборка.КВБордеро - Выборка.ПроцентСкидкиЗасчетКВ;
			СтрокаБСО.ВознаграждениеАгентаСумма = Окр((Выборка.КВБордеро - Выборка.ПроцентСкидкиЗасчетКВ) * Выборка.СтраховаяПремияОтКлиента / 100, 2);
			СтрокаБСО.ПремияСтраховщику = СтрокаБСО.СтраховаяПремияОтКлиента - СтрокаБСО.ВознаграждениеАгентаСумма;
		ИначеЕсли ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ Тогда
			СтрокаБСО.ВознаграждениеАгентаПроцент = Выборка.КВДВОУ;	
			СтрокаБСО.ВознаграждениеАгентаСумма = Окр(Выборка.КВДВОУ * Выборка.СтраховаяПремияОтКлиента / 100, 2);
			СтрокаБСО.ПремияСтраховщику = СтрокаБСО.СтраховаяПремияОтКлиента - СтрокаБСО.ВознаграждениеАгентаСумма;
		Иначе
			Если НЕ Выборка.НомерПодзапроса = 3 Тогда
				СтрокаБСО.ВознаграждениеАгентаПроцент = Выборка.КВДВОУ + Выборка.КВБордеро - Выборка.ПроцентСкидкиЗасчетКВ;
				СтрокаБСО.ВознаграждениеАгентаСумма = Окр((Выборка.КВДВОУ + Выборка.КВБордеро - Выборка.ПроцентСкидкиЗасчетКВ) * Выборка.СтраховаяПремияОтКлиента / 100, 2);
				СтрокаБСО.ПремияСтраховщику = СтрокаБСО.СтраховаяПремияОтКлиента - СтрокаБСО.ВознаграждениеАгентаСумма;
			КонецЕсли;	
		КонецЕсли;	
		
		СтрокаБСО.СрокСтрахования = "" + Формат(Выборка.ДатаНачалаСтрахования, "ДЛФ=Д") + " - " + Формат(Выборка.ДатаОкончанияСтрахования, "ДЛФ=Д");
		
	КонецЦикла;
				
				
	//ИначеЕсли ВариантЗаполнения = "ЗаполнитьПоАктамСдаиПриемки" Тогда
	//			
	//	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	        |	Renault_АктСдачиПриемкиБСОБСО.Страхователь,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ВидСтрахования,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.Банк,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ТипБСО,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.СерияБСО,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.НомерБСО,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.СерияКвитанции,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.НомерКвитанции,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ДатаСтрахования,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ДатаОплатыПоКвитанции,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.СтраховаяПремияОтКлиента,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ВознаграждениеАгентаПроцент,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ВознаграждениеАгентаСумма,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ПремияСтраховщику,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.СрокСтрахования,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.Агент,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.Каско,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.Даго,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.НС,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ВключитьВОтчетность,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.СтраховойПолис,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ПроцентСкидкиЗасчетКВ,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ОбщаяСумма,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.СтатусБСО,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.НомерПолиса,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ТипКвитанции,
	//	        |	ЕСТЬNULL(Renault_ФинансовыеПолитикиСтраховыхКомпанийСрезПоследних.КВБордеро, 0) КАК КВБордеро,
	//	        |	ЕСТЬNULL(Renault_ФинансовыеПолитикиСтраховыхКомпанийСрезПоследних.КВДВОУ, 0) КАК КВДВОУ,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.БезКвитанции,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ОплатаСтраховогоПолиса,
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ШтрихКод
	//	        |ИЗ
	//	        |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	        |		Renault_ПринятыеВОтчетностьБСООбороты.Регистратор КАК Регистратор
	//	        |	ИЗ
	//	        |		РегистрНакопления.Renault_ПринятыеВОтчетностьБСО.Обороты(
	//	        |				НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ),
	//	        |				КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ),
	//	        |				Регистратор,
	//	        |				Организация = &Организация
	//	        |					И СтраховаяКомпания = &СтраховаяКомпания
	//	        |					И ВидОперации = ЗНАЧЕНИЕ(Перечисление.Renault_ВидыОперацийАктСдачиПриемкиБСО.АктСдачиПриемки)) КАК Renault_ПринятыеВОтчетностьБСООбороты) КАК ВложенныйЗапрос
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_АктСдачиПриемкиБСО.БСО КАК Renault_АктСдачиПриемкиБСОБСО
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ФинансовыеПолитикиСтраховыхКомпаний.СрезПоследних(КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ), СтраховаяКомпания = &СтраховаяКомпания) КАК Renault_ФинансовыеПолитикиСтраховыхКомпанийСрезПоследних
	//	        |			ПО Renault_АктСдачиПриемкиБСОБСО.ВидСтрахования = Renault_ФинансовыеПолитикиСтраховыхКомпанийСрезПоследних.ВидСтрахования
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ПринятыеВОтчетностьБСО.Обороты(
	//	        |					,
	//	        |					,
	//	        |					,
	//	        |					ВидОперации = &ВидОперации
	//	        |						И Организация = &Организация
	//	        |						И СтраховаяКомпания = &СтраховаяКомпания) КАК ПринятыеПолисы
	//	        |			ПО Renault_АктСдачиПриемкиБСОБСО.ТипБСО = ПринятыеПолисы.ТипБСО
	//	        |				И Renault_АктСдачиПриемкиБСОБСО.СерияБСО = ПринятыеПолисы.СерияБСО
	//	        |				И Renault_АктСдачиПриемкиБСОБСО.НомерБСО = ПринятыеПолисы.НомерБСО
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ПринятыеВОтчетностьБСО.Обороты(
	//	        |					,
	//	        |					,
	//	        |					,
	//	        |					ВидОперации = &ВидОперации
	//	        |						И Организация = &Организация
	//	        |						И СтраховаяКомпания = &СтраховаяКомпания) КАК ПринятыеКвитанции
	//	        |			ПО Renault_АктСдачиПриемкиБСОБСО.ТипКвитанции = ПринятыеКвитанции.ТипБСО
	//	        |				И Renault_АктСдачиПриемкиБСОБСО.СерияКвитанции = ПринятыеКвитанции.СерияБСО
	//	        |				И Renault_АктСдачиПриемкиБСОБСО.НомерКвитанции = ПринятыеКвитанции.НомерБСО
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Renault_ПринятыеОплатыБезКвитанции.Обороты(, , , ВидОперации = &ВидОперации) КАК Renault_ПринятыеОплатыБезКвитанцииОбороты
	//	        |			ПО (ВЫБОР
	//	        |					КОГДА Renault_АктСдачиПриемкиБСОБСО.БезКвитанции
	//	        |						ТОГДА Renault_АктСдачиПриемкиБСОБСО.ОплатаСтраховогоПолиса = Renault_ПринятыеОплатыБезКвитанцииОбороты.ОплатаСтраховогоПолиса
	//	        |					ИНАЧЕ ЛОЖЬ
	//	        |				КОНЕЦ)
	//	        |		ПО ВложенныйЗапрос.Регистратор = Renault_АктСдачиПриемкиБСОБСО.Ссылка
	//	        |ГДЕ
	//	        |	Renault_АктСдачиПриемкиБСОБСО.ВключитьВОтчетность
	//	        |	И ВЫБОР
	//	        |			КОГДА Renault_АктСдачиПриемкиБСОБСО.НомерКвитанции = """"
	//	        |				ТОГДА ПринятыеПолисы.НомерБСО ЕСТЬ NULL 
	//	        |			ИНАЧЕ ПринятыеКвитанции.НомерБСО ЕСТЬ NULL 
	//	        |		КОНЕЦ
	//	        |	И ВЫБОР
	//	        |			КОГДА Renault_АктСдачиПриемкиБСОБСО.БезКвитанции
	//	        |				ТОГДА Renault_ПринятыеОплатыБезКвитанцииОбороты.ОплатаСтраховогоПолиса ЕСТЬ NULL 
	//	        |			ИНАЧЕ ИСТИНА
	//	        |		КОНЕЦ";
	//			
	//			
	//	Запрос.Текст = Текст;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Если ФормироватьПоВидуСтрахования Тогда
	//		СписокВидовСтрахования = ВидСтрахования.Получить();
	//	КонецЕсли;	
	//			
	//	Пока Выборка.Следующий()Цикл
	//		
	//		Если ФормироватьПоВидуСтрахования И СписокВидовСтрахования.НайтиПоЗначению(Выборка.ВидСтрахования) = неопределено Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если ПоСтатусу И НЕ Статус = Выборка.СтатусБСО Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ И Выборка.КВДВОУ = 0 Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		
	//		Если (ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.Бордеро 
	//			ИЛИ ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ) 
	//			И Выборка.СтатусБСО <> Перечисления.Renault_СтатусыБСО.Продан Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		
	//		Если Выборка.НомерБСО = NULL Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		
	//		СтрокаБСО = БСО.Добавить();
	//		ЗаполнитьЗначенияСвойств(СтрокаБСО,Выборка);
	//		
	//		//Если СтрокаБСО.СтраховойПолис.НеСвязанСНомеромБСО И СтрокаБСО.НомерПолиса = "" Тогда
	//		//	СтрокаБСО.НомерПолиса = СтрокаБСО.СтраховойПолис.НомерПолиса;
	//		//КонецЕсли;	
	//		
	//		СтрокаБСО.ВключитьВОтчетность = Истина;
	//		Если ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.Бордеро ИЛИ ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ВстречноеБордеро Тогда
	//			СтрокаБСО.ВознаграждениеАгентаПроцент = Выборка.КВБордеро - Выборка.ПроцентСкидкиЗасчетКВ;
	//			СтрокаБСО.ВознаграждениеАгентаСумма = Окр((Выборка.КВБордеро - Выборка.ПроцентСкидкиЗасчетКВ) * Выборка.СтраховаяПремияОтКлиента / 100, 2);
	//			СтрокаБСО.ПремияСтраховщику = СтрокаБСО.СтраховаяПремияОтКлиента - СтрокаБСО.ВознаграждениеАгентаСумма;
	//		ИначеЕсли ВидОперации = Перечисления.Renault_ВидыОперацийАктСдачиПриемкиБСО.ДВОУ Тогда
	//			СтрокаБСО.ВознаграждениеАгентаПроцент = Выборка.КВДВОУ;	
	//			СтрокаБСО.ВознаграждениеАгентаСумма = Окр(Выборка.КВДВОУ * Выборка.СтраховаяПремияОтКлиента / 100, 2);
	//			СтрокаБСО.ПремияСтраховщику = СтрокаБСО.СтраховаяПремияОтКлиента - СтрокаБСО.ВознаграждениеАгентаСумма;
	//		Иначе
	//			//Если НЕ Выборка.НомерПодзапроса = 3 Тогда
	//			//	СтрокаБСО.ВознаграждениеАгентаПроцент = Выборка.КВДВОУ + Выборка.КВБордеро;
	//			//	СтрокаБСО.ВознаграждениеАгентаСумма = Окр((Выборка.КВДВОУ + Выборка.КВБордеро) * Выборка.СтраховаяПремияОтКлиента / 100, 2);
	//			//	СтрокаБСО.ПремияСтраховщику = СтрокаБСО.СтраховаяПремияОтКлиента - СтрокаБСО.ВознаграждениеАгентаСумма;
	//			//КонецЕсли;	
	//		КонецЕсли;	
	//		
	//	КонецЦикла;	
	//	
	//Иначе 
	//	
	//	Возврат;
	//	
	//КонецЕсли;			
			
	
		
	//БСОДоФильтра = БСО.Выгрузить();
	
КонецПроцедуры	

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОтчетностьПринята = ложь;
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры
	
	
Процедура ПечатьАктаСдачиПриемкиРесо(ИмяМакета)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	
	ТабДок.ПолеСверху              = 0;
	ТабДок.ПолеСлева               = 5;
	ТабДок.ПолеСнизу               = 0;
	ТабДок.ПолеСправа              = 5;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу  = 0;
	ТабДок.АвтоМасштаб             = Истина;
	ТабДок.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
		
    Область = Макет.ПолучитьОбласть("Шапка");
	Если Найти(Организация.Наименование, "СПб") Тогда
		Область.Параметры.Город = "г. Санкт-Петербург";
	Иначе
		Область.Параметры.Город = "г. Москва";
	КонецЕсли;	
	Область.Параметры.Заголовок = "АКТ СДАЧИ-ПРИЕМКИ ВЫПОЛНЕННЫХ РАБОТ № " + Номер + " от  " + Формат(Дата,"ДЛФ=ДД");
	Область.Параметры.Текст = "Мы, нижеподписавшиеся, " + """" + СтраховаяКомпания +""""+" в лице ____________, и " + """"+ Организация + """" +" в лице __________, составили настоящий Акт в том, что в период с " + Формат (ПериодС,"ДЛФ=ДД")+ " по " +Формат(ПериодПо,"ДЛФ=ДД") +" Агентом, согласно договору  были оказаны посреднические услуги, связанные с заключением договоров страхования, в результате чего на расчетный счет " + """" + СтраховаяКомпания +"""" + " были перечислены страховые взносы по указанным ниже договорам (полисам)";
	
	ТабДок.Вывести(Область);
	
    ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицыРесо");
	//ТабДок.Вывести(ОбластьШапкаТаблицы);
	
    ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
    ОбластьИтоги = Макет.ПолучитьОбласть("ИтогиРесо");
	Ном              = 0;
	КоличествоСтрок = БСО.Количество();
	НомерСтраницы   = 1;
	НомерСтроки = 1;
	
	// инициализация итогов по странице
	ИтогоСтраховаяПремияОтКлиента = 0;
	ИтогоОбщаяСумма = 0;
	ИтогоВознаграждениеАгентаСумма        = 0;
	ИтогоПремияСтраховщику  = 0;
	//ИтогоКаско       = 0;
	//ИтогоДаго         = 0;
	//ИтогоНС   = 0;
	
	//// инициализация итогов по документу
	//ИтогоМассаБрутто = 0;
	//ИтогоМест        = 0;
	//ИтогоКоличество  = 0;
	//ИтогоСуммаСНДС   = 0;
	//ИтогоСумма       = 0;
	//ИтогоНДС         = 0;
	//Ном              = 0;
		
	
	// Создаем массив для проверки вывода
	МассивВыводимыхОбластей = Новый Массив;
	
	//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	
	Для Каждого Строка Из БСО Цикл
		Если Не Строка.ВключитьВОтчетность Тогда 
			Продолжить;
		КонецЕсли;
		
			Ном           = Ном + 1;
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРесо");
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Строка);
			ОбластьСтрока.Параметры.СерияНомерБСО =  СокрЛП(Строка.СерияБСО) + СокрЛП(Строка.НомерБСО);
			ОбластьСтрока.Параметры.СерияНомерКвитанции =  СокрЛП(Строка.СерияКвитанции) + СокрЛП(Строка.НомерКвитанции);
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки =  НомерСтроки + 1;
			ТабДок.Вывести(ОбластьСтрока);
			//Если Ном = 1 Тогда // первая срока
				
				//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
				//ТабДок.Вывести(ОбластьШапкаТаблицы);
				
			//Иначе
			//	
			//	МассивВыводимыхОбластей.Очистить();
			//	МассивВыводимыхОбластей.Добавить(ОбластьСтрока);
			//	МассивВыводимыхОбластей.Добавить(ОбластьИтоги);
			//	Если Ном = КоличествоСтрок Тогда
			//		МассивВыводимыхОбластей.Добавить(ОбластьИтоги);
			//		МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
			//	КонецЕсли;		
			//	
			//	Если Ном <> 1 И НЕ ТабДок.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					//ОбластьИтоги.Параметры.ИтогоСтраховаяПремияОтКлиента = ИтогоСтраховаяПремияОтКлиента;
					//ОбластьИтоги.Параметры.ИтогоОбщаяСумма               = ИтогоОбщаяСумма;
					//ОбластьИтоги.Параметры.ИтогоВознаграждениеАгентаСумма        = ИтогоВознаграждениеАгентаСумма;
					//ОбластьИтоги.Параметры.ИтогоПремияСтраховщику  = ИтогоПремияСтраховщику;
					//ОбластьИтоги.Параметры.ИтогоКаско       = ИтогоКаско;
					//ОбластьИтоги.Параметры.ИтогоДаго         = ИтогоДаго;
					//ОбластьИтоги.Параметры.ИтогоНС   = ИтогоНС;
					//
					//ТабДок.Вывести(ОбластьИтоги);
					
					// очистим итоги по странице
					//ИтогоСтраховаяПремияОтКлиента = 0;
					//ИтогоОбщаяСумма = 0;
					//ИтогоВознаграждениеАгентаСумма        = 0;
					//ИтогоПремияСтраховщику  = 0;
					//ИтогоКаско       = 0;
					//ИтогоДаго         = 0;
					//ИтогоНС   = 0;
					
					//НомерСтраницы = НомерСтраницы + 1;
					//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					//ТабДок.Вывести(ОбластьШапкаТаблицы);
					
				//КонецЕсли;
				
			//КонецЕсли;		
			
			//ТабДок.Вывести(ОбластьСтрока);
			
					ИтогоСтраховаяПремияОтКлиента  = ИтогоСтраховаяПремияОтКлиента + Строка.СтраховаяПремияОтКлиента;
					ИтогоОбщаяСумма                = ИтогоОбщаяСумма + Строка.ОбщаяСумма;
					ИтогоВознаграждениеАгентаСумма = ИтогоВознаграждениеАгентаСумма + Строка.ВознаграждениеАгентаСумма;
					ИтогоПремияСтраховщику  = ИтогоПремияСтраховщику + Строка.ПремияСтраховщику;
					//ИтогоКаско       = ИтогоКаско + Строка.Каско;
					//ИтогоДаго        = ИтогоДаго + Строка.Даго;
					//ИтогоНС          = ИтогоНС+ Строка.НС;

				КонецЦикла;
				
				
				
	ИтогоСтраховаяПремияОтКлиента = БСО.Итог("СтраховаяПремияОтКлиента");
	ИтогоОбщаяСумма = БСО.Итог("ОбщаяСумма");
	ИтогоВознаграждениеАгентаСумма = БСО.Итог("ВознаграждениеАгентаСумма");
	ИтогоПремияСтраховщику = БСО.Итог("ПремияСтраховщику");
	//ИтогоКаско = БСО.Итог("Каско");
	//ИтогоДаго =  БСО.Итог("Даго");
	//ИтогоНС = БСО.Итог("НС");
	
	
	ОбластьИтоги.Параметры.ИтогоСтраховаяПремияОтКлиента = ИтогоСтраховаяПремияОтКлиента;
	ОбластьИтоги.Параметры.ИтогоОбщаяСумма = ИтогоОбщаяСумма;
	ОбластьИтоги.Параметры.ИтогоВознаграждениеАгентаСумма = ИтогоВознаграждениеАгентаСумма;
	ОбластьИтоги.Параметры.ИтогоПремияСтраховщику = ИтогоПремияСтраховщику;
	//ОбластьИтоги.Параметры.ИтогоКаско = ИтогоКаско;
	//ОбластьИтоги.Параметры.ИтогоДаго = ИтогоДаго;
	//ОбластьИтоги.Параметры.ИтогоНС = ИтогоНС;
	ТабДок.Вывести(ОбластьИтоги);
	
	//ОбластьПодвала.Параметры.ИтогоСтраховаяПремияОтКлиента = ИтогоСтраховаяПремияОтКлиента;
	ОбластьПодвала.Параметры.ИтогоВознаграждениеАгентаСумма = ИтогоВознаграждениеАгентаСумма;
	ОбластьПодвала.Параметры.ИтогоПремияСтраховщику = ИтогоПремияСтраховщику;
	//ОбластьПодвала.Параметры.Агенту = ИтогоКаско + ИтогоДаго + ИтогоНС;
	
	
	//ОбластьПодвала.Параметры.ИтогоВознаграждениеАгентаСуммаПрописью = "("+ЧислоПрописью(ИтогоСтраховаяПремияОтКлиента, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	ОбластьПодвала.Параметры.ИтогоВознаграждениеАгентаСуммаПрописью = "("+ЧислоПрописью(ИтогоВознаграждениеАгентаСумма, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	ОбластьПодвала.Параметры.ИтогоПремияСтраховщикуПрописью = "("+ЧислоПрописью(ИтогоПремияСтраховщику, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	//ОбластьПодвала.Параметры.АгентуПрописью = "("+ЧислоПрописью(ИтогоКаско + ИтогоДаго + ИтогоНС, ,"руб.,руб.,руб.,м,коп.,коп.,коп.,ж")+")";
	ТабДок.Вывести(ОбластьПодвала);
	
	
	
    Область = Макет.ПолучитьОбласть("Подписи");
	Область.Параметры.ОтИмениОрганизации = "От имени " + """" + СтраховаяКомпания + """";
	Область.Параметры.ОтИмениСтраховойКомпании = "От имени "  + """" + Организация + """";
	
	ТабДок.Вывести(Область);
	ТабДок.Показать();
	
КонецПроцедуры
